{"pages":[{"url":"/pages/about.html.html","text":"Advanced software plays a fundamental role in large scientific projects. The primary goal of DIANA/HEP is to develop state-of-the-art tools for experiments which acquire, reduce, and analyze petabytes of data. Improving performance, interoperability, and collaborative tools through modifications and additions to ROOT and other packages broadly used by the community will allow users to more fully exploit the data being acquired at CERN's Large Hadron Collider (LHC) and other facilities. As part of the NSF's Software Infrastructure for Sustained Innovation (SI2) program, DIANA is concerned with the overarching goal of transforming innovations in research and education into sustained software resources that are an integral part of the cyberinfrastructure. Project Team Peter Elmer (Lead PI) - Princeton University, Department of Physics Brian P. Bockelman (PI) - University of Nebraska-Lincoln, Department of Computer Science and Engineering Kyle Cranmer (PI) - New York University, Department of Physics & Center for Data Science Michael D. Sokoloff (PI) - University of Cincinnati, Department of Physics Jinyang Li (Senior Personnel) - New York University, Computer Science Department David Lange - Princeton University, Department of Physics Gilles Louppe - New York University, Department of Physics & Center for Data Science James Pivarski - Princeton University, Department of Physics Eduardo Rodrigues - University of Cincinnati, Department of Physics Zhe Zhang - University of Nebraska-Lincoln, Department of Computer Science and Engineering (Ph.D. Student) Chien-Chin Huang - New York University, Computer Science Department (Ph.D. Student) Advisory Board Amber Boehnlein - CIO, Thomas Jefferson National Accelerator Facility Katherine Copic - Director of Growth, Insight Data Science Jacob VanderPlas - Director of Research, Physical Sciences, eScience Institute, University of Washington Fernando Pérez - Staff Scientist, Data Science and Technology Division, Lawrence Berkeley National Laboratory; Associate Researcher, Berkeley Institute for Data Science, UC Berkeley. Attanagoda Santha - Architect, Fannie Mae Collaborators The ROOT team at CERN and Fermilab Acknowledgement This project is supported by National Science Foundation grants ACI-1450310, ACI-1450319, ACI-1450323, and ACI-1450377. Any opinions, findings, conclusions or recommendations expressed in this material are those of the developers and do not necessarily reflect the views of the National Science Foundation.","tags":"pages","title":"DIANA Overview"},{"url":"/pages/activities.html.html","text":"Software products DIANA/HEP organization on GitHub carl docs histogrammar docs Papers Carl in the Journal of Open Source Software Presentations by the DIANA team DIANA-HEP Organization in the INDICO agenda system 25 May 2016 - DIANA IO Update , Brian Bockelman, ROOT I/O Workshop 23 May 2016 - Chains of functional primitives , Jim Pivarski, ROOT Team Meeting 19 May 2016 - The DIANA-HEP Project , Jim Pivarski, US-CMS Collaboration Meeting 2 May 2016 - Introduction to DIANA/HEP , Peter Elmer, HEP Software Foundation Workshop 25 Apr 2016 - Histogramming in map-reduce , Jim Pivarski, DIANA Meeting 18 Apr 2016 - Introduction to DIANA/HEP , Peter Elmer, ROOT Team Meeting 13 Apr 2016 - Robust and Calibrated Classifiers with Scikit-Learn , Gilles Louppe, Zurich ML meetup, Switzerland 13 Apr 2016 - Approximating likelihood ratios with Calibrated Classifiers , Gilles Louppe, ETH, Zurich, Switzerland 11 Apr 2016 - Bayesian Optimization , Gilles Louppe, DIANA Meeting 11 Apr 2016 - Introduction to DIANA/HEP , Peter Elmer, DIANA Meeting 30 Mar 2016 - Bayesian Optimization , Gilles Louppe, ATLAS ML workshop 29 Mar 2016 - Approximating likelihood ratios with Calibrated Classifiers , Gilles Louppe, ATLAS ML workshop 7 Mar 2016 - Computing practices observed in industry , Jim Pivarski, ROOT Team Meeting 7 Mar 2016 - ROOT-Spark integration , Jim Pivarski, ROOT Team Meeting 3 Mar 2016 - The DIANA/HEP Project , Eduardo Rodrigues, LHCb-wide Amplitude Analysis Meeting on an Ampl. Ana. software library 22 Feb 2016 - Accessing ROOT from the JVM (update) , Jim Pivarski, DIANA Meeting 22 Feb 2016 - Notes from Heavy Flavour Data Mining Workshop , Eduardo Rodrigues, DIANA Meeting 22 Feb 2016 - Approximating density ratios with machine learning for likelihood-free inference , Gilles Louppe, DIANA Meeting 18 Feb 2016 - An introduction to machine learning with Scikit-Learn , Gilles Louppe, Heavy Flavour Data Mining workshop 8 Feb 2016 - Accessing ROOT from the JVM (Java/Scala) , Jim Pivarski, CMS Software and Computing R&D Working Meeting","tags":"pages","title":"Activities and Research Products"},{"url":"/pages/fellowprojects.html.html","text":"Proposing a Project If you are interested in a DIANA Fellow position, you can propose a project. In the proposal you should briefly describe the software development activity that you would like to pursue, and how that activity will enhance your own and other people's research activities. Note also the intended software project or person with whom you will collaborate and the location where you would like to travel for that collaboration. The proposal should be short, typically no more than 2-3 paragraphs. Submit your project proposal by email to mike.sokoloff@uc.edu . In 2016, DIANA Fellow positions will be awarded in a rolling fashion based on submitted project proposals. If you are involved in a software project used by the community and have specific projects which could be of interest to potential DIANA Fellows, please send your ideas to mike.sokoloff@uc.edu .They can be listed as example projects in the list below. Example Projects of Interest","tags":"pages","title":"DIANA Fellow Projects"},{"url":"/pages/.html","text":"","tags":"pages","title":""},{"url":"/pages/jobs.html.html","text":"DIANA Fellows The DIANA Fellows program provides support for 4 graduate students each year to spend 3 months intensively developing software tools in conjunction with collaborating institutions. The graduate student should have a base stipend from their home institution. The DIANA Fellows program will provides travel and subsistence funds to support direct collaboration with others developing software tools for general use at a second institution. See the Fellow Projects page for example projects of interest and details on how to propose your own project. For more information, contact mike.sokoloff@uc.edu . DIANA Undergraduate Fellow A DIANA Undergraduate Fellow position is also available each year. The student will work 10-12 weeks during the summer, either developing or using data-intensive tools. The DIANA project will provide a stipend for the summer period. For more information on the DIANA Undergraduate Fellow position contact mike.sokoloff@uc.edu . Princeton Princeton University is looking for candidates to work on projects funded as an Intel Parallel Computing Center (IPCC) . This IPCC will work in collaboration with the DIANA project and the ROOT team to modernize aspects of the I/O and Math libraries in ROOT. (Job announcement forthcoming, please contact Peter.Elmer@cern.ch in the meantime.) Nebraska The University of Nebraska-Lincoln is currently searching for a new Software Engineer hire to work on the DIANA project. Within the DIANA project, Nebraska is focusing on improving the performance and interoperability of ROOT I/O. Interested applicants should apply to http://employment.unl.edu/ under requisition S_150926. A summary from the posting's job description (https://employment.unl.edu/postings/47681): The Holland Computing Center (HCC) is a large High Performance Computing facility supporting the NU system. Position will work with other HCC personnel on the DIANA/HEP project which focuses on improving performance, increasing interoperability between HEP software analysis tools and other data-intensive scientific computing ecosystems (such as Apache Spark). Responsibilities include design and implementation of application interfaces; interacting with, using and managing large datasets and solving data-centric problems; organizing, visualizing and communicating digital data effectively. Position serves in both technical and management roles, working closely with technical specialists (e.g. application developers) and with user support (e.g. researchers). Position develops state-of-the-art data analysis tools for experiments which acquire, reduce, and analyze petabytes of data. Criminal background check will be conducted. Excellent benefits including staff/dependent scholarship program. Applicant review begins Feb 8. View requisition S_150926 at https://employment.unl.edu for details and to apply. UNL does not discriminate based upon any protected status. Please see http://www.unl.edu/equity/notice-nondiscrimination. While application reviews begins Feb 8, new applications can be accepted until the position is filled.","tags":"pages","title":"Opportunities"},{"url":"/Symmetry.html","text":"Symmetry magazine ran a nice article on the DIANA/HEP project. \"The software we used to build the LHC and perform our analyses is 20 years old,\" says Peter Elmer, a physicist at Princeton University. \"Technology evolves, so we have to ask, does our software still make sense today? Will it still do what we need 20 or 30 years from now?\" Compatible and sustainable software could revolutionize high-energy physics research: https://t.co/wdQZtZiY7o pic.twitter.com/1owe3Vo73I — symmetry magazine (@symmetrymag) April 1, 2016 The next big LHC upgrade? Software: https://t.co/wdQZtZAzvY pic.twitter.com/eDffrB29UQ — symmetry magazine (@symmetrymag) March 24, 2016","tags":"Blog","title":"The next big LHC upgrade? Software."},{"url":"/Announcing_Diana.html","text":"We are proud to announce that DIANA/HEP has been funded by the National Science Foundation's Software Infrastructure for Sustained Innovation (SI2) program. We are just kicking off the project, and will be updating these web pages and adding posts as we go along. We have created DIANA-HEP GitHub Organization This is a little badge to make sure the web site is healthy:","tags":"Blog","title":"Announcing DIANA"}]}