{"pages":[{"url":"/pages/about.html.html","text":"Project Overview Advanced software plays a fundamental role in large scientific projects. The primary goal of DIANA/HEP (Data Intensive ANAlysis for High Energy Physics) is to develop state-of-the-art tools for experiments which acquire, reduce, and analyze petabytes of data. Improving performance, interoperability, and collaborative tools through modifications and additions to packages broadly used by the community will allow users to more fully exploit the data being acquired at CERN's Large Hadron Collider (LHC) and other facilities. These experiments are addressing questions at the heart of physics -- what are the underlying constituents of matter and how do they interact? With the discovery of the Higgs boson in 2012, the Standard Model of particle physics is complete. It provides an excellent description of known particles and forces. However, the most interesting questions remain open, for example: What is the dark matter which pervades the universe? Does space-time have additional symmetries or extend beyond the 3 spatial dimensions we know? What is the mechanism stabilizing the Higgs boson mass from enormous quantum corrections? The next generation of experiments will collect exabyte-scale data samples to provide answers to these and many other questions. Analyzing this data will require new and better tools. DIANA will provide the CPU and IO performance needed to reduce the iteration time so crucial to explore new ideas. We will develop software to effectively exploit emerging many- and multi-core hardware. We will establish infrastructure for a higher-level of collaborative analysis, building on the successful patterns used for the Higgs boson discovery and enabling a deeper communication between the theoretical community and the experimental community. DIANA's products will sit in the ROOT framework, already used by our community of more than 10,000 particle and nuclear physicists. By improving interoperability with the larger scientific software ecosystem, DIANA will also incorporate best practices and algorithms from other disciplines into HEP. We will provide training for students in these techniques. Similarly, we will make our computing insights, tools, and novel ideas related to collaborative analysis, standards for data preservation, and best practices for treating software as a research product available to the larger scientific community. PROJECT PERSONNEL Peter Elmer (Lead PI) - Princeton University Department of Physics Kyle Cranmer (Co-PI) - New York University Department of Physics & Center for Data Science Jinyang Li (Senior Personnel) - New York University Computer Science Department Michael D. Sokoloff (Co-PI) - University of Cincinnati Main Campus Department of Physics Brian P. Bockelman (Co-PI) - University of Nebraska-Lincoln Department of Computer Science and Engineering Advisory Board Amber Boehnlein - Head of Scientific Computing at SLAC National Accelerator Laboratory Katherine Copic - Director of Growth, Insight Data Science Jacob VanderPlas - Director of Research, Physical Sciences, eScience Institute, University of Washington Fernando Pérez - Staff Scientist, Data Science and Technology Division, Lawrence Berkeley National Laboratory; Associate Researcher, Berkeley Institute for Data Science, UC Berkeley. Attanagoda Santha - Architect, Fannie Mae Acknowledgement This project is supported by National Science Foundation grants ACI-1450310, ACI-1450319, ACI-1450323, and ACI-1450377 . Any opinions, findings, conclusions or recommendations expressed in this material are those of the developers and do not necessarily reflect the views of the National Science Foundation.","tags":"pages","title":"DIANA Overview"},{"url":"/pages/home.html","text":"The primary goal of DIANA/HEP (Data Intensive ANAlysis for High Energy Physics) is developing state-of-the-art tools for experiments which acquire, reduce, and analyze petabytes of data. Improving performance, interoperability, and collaborative tools through modifications and additions to packages broadly used by the community will allow users to more fully exploit the data being acquired at CERN's Large Hadron Collider (LHC) and other facilities. Focus Areas RIO - ROOT I/O technology Emerging Architectures - vectorization, parallelization, GPUs (GooFit) Interoperability - particularly with the scientific Python ecosystem Collaborative Analysis Tools - RooFit, RooStats, HepData interfaces, and analysis preservation DIANA/HEP is funded by the National Science Foundation's Software Infrastructure for Sustained Innovation (SI2) program. Tweets by @diana_hep !function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/&#94;http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+\"://platform.twitter.com/widgets.js\";fjs.parentNode.insertBefore(js,fjs);}}(document,\"script\",\"twitter-wjs\"); We're hiring! Learn more","tags":"pages","title":"Home"},{"url":"/pages/jobs.html.html","text":"PROJECT PERSONNEL Peter Elmer (Lead PI) - Princeton University Department of Physics Kyle Cranmer (Co-PI) - New York University Department of Physics & Center for Data Science Jinyang Li (Senior Personnel) - New York University Computer Science Department Michael D. Sokoloff (Co-PI) - University of Cincinnati Main Campus Department of Physics Brian P. Bockelman (Co-PI) - University of Nebraska-Lincoln Department of Computer Science and Engineering Openings RIO Emerging Architectures Interoperability with the Scientific Python Ecosystem Collaborative Analysis Tools","tags":"pages","title":"Job Opportunities"},{"url":"/Announcing_Diana.html","text":"We are proud to announce that DIANA/HEP has been funded by the National Science Foundation's Software Infrastructure for Sustained Innovation (SI2) program. We are just kicking off the project, and will be updating these web pages and adding posts as we go along. We have created DIANA-HEP GitHub Organization This is a little badge to make sure the web site is healthy:","tags":"Blog","title":"Announcing DIANA"}]}