{"pages":[{"url":"/pages/about.html.html","text":"Advanced software plays a fundamental role in large scientific projects. The primary goal of DIANA/HEP is to develop state-of-the-art tools for experiments which acquire, reduce, and analyze petabytes of data. Improving performance, interoperability, and collaborative tools through modifications and additions to ROOT and other packages broadly used by the community will allow users to more fully exploit the data being acquired at CERN's Large Hadron Collider (LHC) and other facilities. As part of the NSF's Software Infrastructure for Sustained Innovation (SI2) program, DIANA is concerned with the overarching goal of transforming innovations in research and education into sustained software resources that are an integral part of the cyberinfrastructure. Project Team Peter Elmer (PI) - Princeton University, Department of Physics Brian P. Bockelman (Co-PI) - University of Nebraska-Lincoln, Department of Computer Science and Engineering Kyle Cranmer (Co-PI) - New York University, Department of Physics & Center for Data Science David Lange - Princeton University, Department of Physics (from Feb. 2016) Jinyang Li (Senior Personnel) - New York University, Computer Science Department Gilles Louppe - New York University, Department of Physics & Center for Data Science James Pivarski - Princeton University, Department of Physics (from Feb. 2016) Eduardo Rodrigues - University of Cincinnati, Department of Physics (from Feb. 2016) Michael D. Sokoloff (Co-PI) - University of Cincinnati, Department of Physics Advisory Board Amber Boehnlein - CIO, Thomas Jefferson National Accelerator Facility Katherine Copic - Director of Growth, Insight Data Science Jacob VanderPlas - Director of Research, Physical Sciences, eScience Institute, University of Washington Fernando Pérez - Staff Scientist, Data Science and Technology Division, Lawrence Berkeley National Laboratory; Associate Researcher, Berkeley Institute for Data Science, UC Berkeley. Attanagoda Santha - Architect, Fannie Mae Collaborators Acknowledgement This project is supported by National Science Foundation grants ACI-1450310, ACI-1450319, ACI-1450323, and ACI-1450377. Any opinions, findings, conclusions or recommendations expressed in this material are those of the developers and do not necessarily reflect the views of the National Science Foundation.","tags":"pages","title":"DIANA Overview"},{"url":"/pages/.html","text":"","tags":"pages","title":""},{"url":"/pages/jobs.html.html","text":"Cincinnati Position already filled. Nebraska Coming soon. NYU Position already filled. Princeton Positions already filled.","tags":"pages","title":"Job Opportunities"},{"url":"/Announcing_Diana.html","text":"We are proud to announce that DIANA/HEP has been funded by the National Science Foundation's Software Infrastructure for Sustained Innovation (SI2) program. We are just kicking off the project, and will be updating these web pages and adding posts as we go along. We have created DIANA-HEP GitHub Organization This is a little badge to make sure the web site is healthy:","tags":"Blog","title":"Announcing DIANA"}]}